---
type: PolymeshFacet
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# PolymeshFacet

`Autodesk.Revit.DB.PolymeshFacet` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PolymeshFacet | 2019.2 | `public PolymeshFacet ( int v1 , int v2 , int v3 )` |
| Method | GetVertices | — | `public IList < int > GetVertices ()` |
| Method | ToString | — | `public override string ToString ()` |
| Property | IsValidObject | — | `public bool IsValidObject { get ; }` |
| Property | V1 | — | `public int V1 { get ; }` |
| Property | V2 | — | `public int V2 { get ; }` |
| Property | V3 | — | `public int V3 { get ; }` |